# GetPluginStyle

## Description
Get the name of the plug-in style for an object.

```pascal
FUNCTION GetPluginStyle(hObject : HANDLE) : STRING;
```

```python

def vs.GetPluginStyle(hObject):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE|Handle to a plug-in object|

## Returns
Returns the name of the plug-in style associated with an object.<BR>
<BR>

## Version
Availability: from Vectorworks 2017
## Category
* Objects - Custom